Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: A relevant submenu is Edit/Global Settings.
es_es: Un submenú relevante es «Editar/Opciones globlales».

source: You will find these entries:
es_es: Encontrará los siguientes elementos:

source: This contains icons for the most often used actions.
es_es: Este contiene los iconos para las acciones más empleadas.

source: Hopefully the icons are self-explanatory.
es_es: La intención es que los iconos se expliquen a sí mismos.

source: There are tooltips to get an extra hint (move the mouse pointer to the icon without clicking and don't move it for a second).
es_es: Hay globos de ayuda que le aconsejan (pon el puntero sobre un botón y no lo muevas durante un segundo).

source: The "Edit/Global Settings/Toggle Toolbar" menu item can be used to make the toolbar disappear.
es_es: La opción «Editar/Opciones globales/Ocultar/Mostrar barra de herramientas» se puede emplear para hacer que la barra de herramientas desaparezca.

source: If you never want a toolbar, use this command in your vimrc file: >
es_es: Si no desea tener una barra de herramientas en ningún momento, escriba esto en su «vimrc»: >

source: This removes the 'T' flag from the 'guioptions' option.
es_es: Esto elimina la opción 'T' de la opción 'guioptions'.

source: Other parts of the GUI can also be enabled or disabled with this option.
es_es: Otras partes de la interfaz gráfica se pueden también activar o desactivar del mismo modo.

source: See the help for it.
es_es: Consulte la ayuda.

source: By default there is one scrollbar on the right.
es_es: Por omisión sólo hay una barra de desplazamiento en la derecha.

source: It does the obvious thing.
es_es: Hace lo que se espera de ella.

source: When you split the window, each window will get its own scrollbar.
es_es: Cada ventana tendrá su barra de desplazamiento.

source: You can make a horizontal scrollbar appear with the menu item Edit/Global Settings/Toggle Bottom Scrollbar.
es_es: Puede hacer que una barra horizontal aparezca con la opción «Editar/ Opciones globales/Ocultar/Mostrar barra de desplazamiento inferior».

source: This is useful in diff mode, or when the 'wrap' option has been reset (more about that later).
es_es: Esto es útil en el modo diff, o cuando la opción 'wrap' está desactivada (eso lo veremos más adelante).

source: When there are vertically split windows, only the windows on the right side will have a scrollbar.
es_es: Cuando hay ventanas divididas verticalmente, sólo las de la derecha tendrán barra de desplazamiento.

source: However, when you move the cursor to a window on the left, it will be this one the that scrollbar controls.
es_es: Sin embargo, si mueve el cursor a una ventana en la izquierda, será esta la que la barra controle.

source: This takes a bit of time to get used to.
es_es: Lleva cierto tiempo acostumbrarse a esto.

source: When you work with vertically split windows, consider adding a scrollbar on the left.
es_es: Cuando trabaje con ventanas divididas verticalmente, considere la posibilidad de añadir barras en la izquierda.

source: This can be done with a menu item, or with the 'guioptions' option: > :set guioptions+=l
es_es: Pruebe con esta opción: > :set guioptions+=1

source: Standards are wonderful.
es_es: Los estándares son maravillosos.

source: In Microsoft Windows, you can use the mouse to select text in a standard manner.
es_es: En Microsoft Windows, puede usar el ratón para seleccionar texto de una forma estándar.

source: The X Window system also has a standard system for using the mouse.
es_es: El sistema de ventanas X Window System también tiene un estándar para el uso del ratón.

source: Unfortunately, these two standards are not the same.
es_es: Por desgracia, estos dos estándares no son compatibles.

source: Fortunately, you can customize Vim.
es_es: Afortunadamente, puede personalizarlo en Vim.

source: You can make the behavior of the mouse work like an X Window system mouse or a Microsoft Windows mouse.
es_es: Puede hacer que el comportamiento del ratón sea el mismo que bajo X o el de Windows.

source: The following command makes the mouse behave like an X Window mouse: >
es_es: La siguiente orden hace que el ratón se comporte como bajo X: >

source: The default behavior of the mouse on UNIX systems is xterm.
es_es: El comportamiento predeterminado de un ratón en los sistemas UNIX es xterm.

source: The default behavior on a Microsoft Windows system is selected during the installation process.
es_es: El comportamiento predeterminado en un sistema Windows se selecciona durante la instalación.

source: For details about what the two behaviors are, see |:behave|.
es_es: Para más detalles sobre estos comportamientos, consulte |:behave|.

source: Here follows a summary.
es_es: Aquí tiene un pequeño resumen:

source: The mouse can be further tuned.
es_es: Puede configurar el ratón con más detalle.

source: Check out these options if you want to change the way how the mouse works:
es_es: Consulte estas opciones si desea cambiar el funcionamiento del ratón:

source: In section |04.7| the basic use of the clipboard was explained.
es_es: En la sección |04.7| se explica el uso básico del portapapeles.

source: There is one essential thing to explain about X-windows: There are actually two places to exchange text between programs.
es_es: Hay algo esencial que debe ser explicado sobre las X-windows: Hay dos lugares para intercambiar texto entre programas.

source: MS-Windows doesn't have this.
es_es: MS-Windows sólo tiene uno.

source: In X-Windows there is the "current selection".
es_es: En X-Windows hay una «selección actual».

source: This is the text that is currently highlighted.
es_es: Esto es el texto que está actualmente marcado.

source: In Vim this is the Visual area (this assumes you are using the default option settings).
es_es: En Vim esto es el área Visual (suponiendo que usa las opciones predeterminadas).

source: You can paste this selection in another application without any further action.
es_es: Puede pegar esta selección en otra aplicación sin ninguna acción posterior.

source: For example, in this text select a few words with the mouse.
es_es: Por ejemplo, en este texto seleccione unas cuantas palabras con el ratón.

source: Vim will switch to Visual mode and highlight the text.
es_es: Vim pasará al modo Visual y resaltará el texto.

source: Now start another gVim, without a file name argument, so that it displays an empty window.
es_es: Ahora inicie otro gVim, sin un nombre de archivo, de forma que muestre una ventana vacía.

source: Click the middle mouse button.
es_es: Pulse el botón central del ratón.

source: The selected text will be inserted.
es_es: El texto seleccionado se insertará.

source: The "current selection" will only remain valid until some other text is selected.
es_es: La «selección actual» sólo será válida hasta que seleccione otro texto.

source: After doing the paste in the other gVim, now select some characters in that window.
es_es: Tras pegar el texto en otro gVim, seleccione ahora algunos caracteres en esa ventana.

source: You will notice that the words that were previously selected in the other gVim window are displayed differently.
es_es: Se dará cuenta de que las palabras que estaban previamente seleccionadas en otra ventana gVim se muestran de otro modo.

source: This means that it no longer is the current selection.
es_es: Esto significa que ya no están en la «selección actual».

source: This use of both the "current selection" and the "real clipboard" might sound a bit confusing.
es_es: Esto de usar simultáneamente la «selección actual» y el «verdadero portapapeles» puede sonar un poco confuso.

source: But it is very useful.
es_es: Pero es muy útil.

source: Let's show this with an example.
es_es: Veámoslo con un ejemplo.

source: Use one gVim with a text file and perform these actions:
es_es: Abra un gVim con un archivo de texto y haga lo siguiente:

source: If you don't like using the mouse, you can access the current selection and the real clipboard with two registers.
es_es: Si no le gusta usar el ratón, puede acceder a la selección actual y al verdadero portapapeles con dos registros.

source: The "* register is for the current selection.
es_es: El registro "* es para la selección actual.

source: To make text become the current selection, use Visual mode.
es_es: Para hacer que el texto se convierta en selección actual, use el modo Visual.

source: For example, to select a whole line just press "V".
es_es: Por ejemplo, para seleccionar una línea completa use «V».

source: To insert the current selection before the cursor: >
es_es: Para insertar la selección actual antes del cursor: >

source: Notice the uppercase "P".
es_es: Observe que es una «P» mayúscula.

source: The lowercase "p" puts the text after the cursor.
es_es: La «p» minúscula la pone tras el cursor.

source: The "+ register is used for the real clipboard.
es_es: El registro "+ se usa para el verdadero portapapeles.

source: For example, to copy the text from the cursor position until the end of the line to the clipboard: >
es_es: Por ejemplo, para copiar el texto desde la posición del cursor hasta el final de línea: >

source: Remember, "y" is yank, which is Vim's copy command.
es_es: Recuerde, «y» es copiar («yank»).

source: To insert the contents of the real clipboard before the cursor: >
es_es: Para insertar los contenidos del verdadero portapapeles antes del cursor: >

source: And now something that is used more often on MS-Windows than on X-Windows.
es_es: Ahora algo que se emplea más habitualmente en MS-Windows que en X-Windows.

source: But both can do it.
es_es: Aún así, ambos pueden hacerlo.

source: You already know about Visual mode.
es_es: Ya conoce el modo Visual.

source: Select mode is like Visual mode, because it is also used to select text.
es_es: El modo Seleccionar es como el modo Visual, también empleado para la selección.

source: But there is an obvious difference: When typing text, the selected text is deleted and the typed text replaces it.
es_es: Pero hay una diferencia básica: Cuando escriba texto, el texto seleccionado se elimina y el texto introducido lo sustituye.

source: Now use the mouse to select some text.
es_es: A continuación, use el ratón para seleccionar algún texto.

source: It is highlighted like in Visual mode.
es_es: Se resaltará como con el modo Visual.

source: Now press a letter.
es_es: Pulse ahora un carácter.

source: The selected text is deleted, and the single letter replaces it.
es_es: El texto seleccionado se eliminará, y ese carácter lo reemplazará.

source: You are in Insert mode now, thus you can continue typing.
es_es: Entrará en modo Insertar.

source: *usr_31.txt* For Vim version 7.3.
es_es: *usr_31.esx* Para Vim versión 7.3.

source: Last change: 2007 May 08
es_es: Último cambio: 8/6/2007

source: Vim works well in a terminal, but the GUI has a few extra items.
es_es: Vim funciona bien en una terminal, pero la interfaz gráfica de usuario tiene algunos elementos adicionales.

source: A file browser can be used for commands that use a file.
es_es: Un explorador de archivos para las órdenes que usan un archivo.

source: A dialog to make a choice between alternatives.
es_es: Una ventana de diálogo para hacer una elección entre alternativas.

source: Use keyboard shortcuts to access menu items quickly.
es_es: Usar accesos directos de teclado para acceder rápidamente a los elementos en los menús.

source: When using the File/Open... menu you get a file browser.
es_es: Al usar el menú «Archivo/Abrir»... obtiene un explorador de archivos.

source: This makes it easier to find the file you want to edit.
es_es: Esto facilita ubicar el archivo que desea editar.

source: But what if you want to split a window to edit another file?
es_es: ¿Pero y si desea dividir una ventana para editar otro archivo?

source: There is no menu entry for this.
es_es: No hay una entrada en el menú para esto.

source: You could first use Window/Split and then File/Open..., but that's more work.
es_es: Puede usar primero «Ventana/Dividir» y luego «Archivo/Abrir»..., pero eso es más trabajo.

source: Since you are typing most commands in Vim, opening the file browser with a typed command is possible as well.
es_es: Ya que está escribiendo la mayoría de las órdenes en Vim, abrir el explorador de archivos con una orden escrita también es posible.

source: To make the split command use the file browser, prepend "browse": >
es_es: Para hacer que la orden de división use el explorador de archivos, anteponga «browse»: >

source: The ":browse" command can be prepended to just about any command that opens a file.
es_es: La orden «:browse» puede ser antepuesta prácticamente a cualquier orden que abra un archivo.

source: If no directory is specified, Vim will decide where to start the file browser.
es_es: Si no se especifica un directorio, Vim será quien determine en qué directorio iniciar el explorador de archivos.

source: By default it uses the same directory as the last time.
es_es: De manera predeterminada se usa el mismo directorio usado la vez anterior.

source: Thus when you used ":browse split" and selected a file in "/usr/local/share", the next time you use a ":browse" it will start in "/usr/local/share" again.
es_es: Así, si se usó «:browse split» y se seleccionó un archivo en «/usr/local/share», la próxima vez que use «:browse» se empezará desde «/usr/local/share» de nuevo.

source: This can be changed with the 'browsedir' option.
es_es: Esto se puede ajustar mediante la opción 'browsedir'.

source: It can have one of three values:
es_es: Dicha opción acepta uno de los tres siguientes valores:

source: Will start the browser in "/usr/local/share".
es_es: Ejecutará el explorador de archivos desde «/usr/local/share».

source: Alternatively: >
es_es: Por otro lado: >

source: Note: To avoid using the mouse, most file browsers offer using key presses to navigate.
es_es: Nota: Para evitar el uso del ratón, muchos de los exploradores de archivos ofrecen navegación mediante teclas.

source: Since this is different for every system, it is not explained here.
es_es: Ya que esto difiere de sistema a sistema, no se explica aquí.

source: Vim uses a standard browser when possible, your system documentation should contain an explanation on the keyboard shortcuts somewhere.
es_es: Vim usa un explorador estándar cuando es posible; la documentación del sistema que use debería contener una sección acerca de los accesos directos de teclado disponibles.

source: When you are not using the GUI version, you could use the file explorer window to select files like in a file browser.
es_es: Cuando no se está usando la versión gráfica de Vim, es posible usar el explorador de archivos para seleccionar archivos de la forma habitual con un explorador de archivos.

source: However, this doesn't work for the ":browse" command.
es_es: Sin embargo, el explorador no funciona con la orden «:browse».

source: See |netrw-browse|.
es_es: Véase |netrw-browse|.

source: Vim protects you from accidentally overwriting a file and other ways to lose changes.
es_es: Vim le protege de sobreescribir accidentalmente un archivo, y de otras formas de perder los cambios realizados.

source: If you do something that might be a bad thing to do, Vim produces an error message and suggests appending ! if you really want to do it.
es_es: Si hace algo que puede ser peligroso, Vim muestra un mensaje de error y sugiere añadir ! si el usuario está seguro de querer hacerlo.

source: To avoid retyping the command with the !, you can make Vim give you a dialog.
es_es: Para evitar teclear de nuevo la orden con el !, puede hacer que Vim le ofrezca un diálogo.

source: You can then press "OK" or "Cancel" to tell Vim what you want.
es_es: Así, podrá pulsar «OK» o «Cancelar» para indicarle a Vim qué desea hacer.

source: For example, you are editing a file and made changes to it.
es_es: Por ejemplo, está editando un archivo y ya hizo algunos cambios.

source: You start editing another file with: >
es_es: Puede editar otro archivo con: >

source: Now make your choice.
es_es: Y ahora puede decidir qué hacer.

source: If you do want to save the changes, select "YES".
es_es: Si desea conservar los cambios, escoja «SÍ».

source: If you want to lose the changes for ever: "NO".
es_es: Si quiere descartar permanentemente los cambios hechos: «NO».

source: If you forgot what you were doing and want to check what really changed use "CANCEL".
es_es: Si olvidó lo que estaba haciendo y quiere revisar cuáles fueron los cambios hechos, use «CANCELAR».

source: You will be back in the same file, with the changes still there.
es_es: Estará de nuevo en el mismo archivo, y los cambios aún estarán allí.

source: Just like ":browse", the ":confirm" command can be prepended to most commands that edit another file.
es_es: Tal como «:browse», la orden «:confirm» se puede anteponer a la mayoría de las órdenes que editan un archivo.

source: They can also be combined: >
es_es: Estas órdenes también se pueden combinar: >

source: This will produce a dialog when the current buffer was changed.
es_es: Esto mostrará un diálogo cuando el búfer actual contiene cambios.

source: Then it will pop up a file browser to select the file to edit.
es_es: Luego se mostrará un explorador de archivos para seleccionar el archivo a editar.

source: Note: In the dialog you can use the keyboard to select the choice.
es_es: Nota: Es posible usar el teclado para seleccionar la opción deseada en el diálogo.

source: Typically the <Tab> key and the cursor keys change the choice.
es_es: Generalmente, la tecla <Tab> y las teclas de cursor cambian la opción seleccionada.

source: Pressing <Enter> selects the choice.
es_es: Pulsar <Enter> escoge la opción definida.

source: This depends on the system though.
es_es: Sin embargo, esto varía de sistema a sistema.

source: When you are not using the GUI, the ":confirm" command works as well.
es_es: Cuando no se usa la GUI, la orden «:confirm» sigue funcionando.

source: Instead of popping up a dialog, Vim will print the message at the bottom of the Vim window and ask you to press a key to make a choice.
es_es: En vez de crear una ventana de diálogo, el mensaje se mostrará en la parte de abajo de la ventana de Vim, y se le solicitará pulsar una tecla para hacer una elección.

source: :confirm edit main.c < Save changes to "Untitled"?
es_es: :confirm edit main.c < Guardar los cambios en "Sin título"?

source: ~ [Y]es, (N)o, (C)ancel: ~
es_es: ~ [Y]es, (N)o, (C)ancelar: ~

source: You can now press the single key for the choice.
es_es: Ahora puede realizar su selección simplemente pulsando una tecla.

source: You don't have to press <Enter>, unlike other typing on the command line.
es_es: En particular, no tiene que pulsar <Enter>, a diferencia del tecleo normal en la línea de órdenes.

source: There is a conflict between using the <Alt> key to select menu items, and using <Alt> key combinations for mappings.
es_es: Hay un conflicto con el uso de la tecla <Alt> para seleccionar elementos de menús, y el uso de la tecla <Alt> en combinaciones de teclas para macros.

source: The 'winaltkeys' option tells Vim what it should do with the <Alt> key.
es_es: La opción 'winaltkeys' le indica a Vim qué hacer con la tecla <Alt>.

source: The default value "menu" is the smart choice: If the key combination is a menu shortcut it can't be mapped.
es_es: El valor predeterminado «menu» es la selección inteligente: si la combinación de teclas es un atajo de teclado para el menú, no se la puede usar en una macro.

source: All other keys are available for mapping.
es_es: Todas las otras teclas están disponibles para crear macros.

source: The value "no" doesn't use any <Alt> keys for the menus.
es_es: El valor «no» hace que no se use ninguna tecla <Alt> para los menús.

source: Thus you must use the mouse for the menus, and all <Alt> keys can be mapped.
es_es: Por esto, es necesario usar el ratón para acceder a los menús, y todas las teclas <Alt> se pueden incluir en macros.

source: The value "yes" means that Vim will use any <Alt> keys for the menus.
es_es: El valor «yes» implica que Vim usará cualquier tecla <Alt> para los menús.

source: Some <Alt> key combinations may also do other things than selecting a menu.
es_es: Algunas combinaciones de teclas con <Alt> pueden hacer cosas distintas a seleccionar un menú.

source: This will only work in the GUI.
es_es: Esto sólo funcionará en la interfaz gráfica.

source: The output may look like this:
es_es: La salida será similar a lo siguiente:

source: The position is given in screen pixels.
es_es: La posición está dada en píxeles de la pantalla.

source: Now you can use the numbers to move Vim somewhere else.
es_es: Puede usar estos números para mover la ventana de Vim a algún otro sitio.

source: For example, to move it to the left a hundred pixels: >
es_es: Por ejemplo, para moverla a la izquierda cien píxeles: >

source: :winpos 172 103 < Note: There may be a small offset between the reported position and where the window moves.
es_es: :winpos 172 103 < Nota: Puede haber un pequeño desfase entre la posición señalada y el sitio al que se mueve la ventana.

source: This is because of the border around the window.
es_es: Esto es debido al borde de la ventana.

source: This is added by the window manager.
es_es: Éste es añadido por el administrador de ventanas.

source: The size of the Vim window is computed in characters.
es_es: El tamaño de la ventana de Vim se calcula en caracteres.

source: Thus this depends on the size of the font being used.
es_es: Por este motivo el tamaño depende del tipo de letra usado.

source: You can see the current size with this command: >
es_es: El tamaño actual puede consultarse con esta orden: >

source: Obtaining the size works in a terminal just like in the GUI.
es_es: Consultar el tamaño funciona en una terminal de la misma manera que en la GUI.

source: Setting the size is not possible in most terminals.
es_es: En la mayoría de las terminales no es posible ajustar el tamaño.

source: {width} and {height} are in characters, {x_offset} and {y_offset} are in pixels.
es_es: {ancho} y {alto} están dados en caracteres, {desplz_x} y {desplz_y} están dados en píxeles.

source: You can use gvim to edit an e-mail message.
es_es: Puede usar gvim para editar mensajes de correo.

source: In your e-mail program you must select gvim to be the editor for messages.
es_es: Debe seleccionar gvim como el editor para sus mensajes en su programa de correo.

source: When you try that, you will see that it doesn't work: The mail program thinks that editing is finished, while gvim is still running!
es_es: Al hacerlo, notará que esto falla: el programa de correo cree que la edición del mensaje ha terminado, ¡aún cuando gvim no se ha cerrado!

source: What happens is that gvim disconnects from the shell it was started in.
es_es: El motivo de este error es que gvim se desconecta de la consola en la que se inició.

source: That is fine when you start gvim in a terminal, so that you can do other work in that terminal.
es_es: Esto funciona bien cuando se inicia gvim desde una terminal, para que se pueda hacer otras cosas en ella.

source: But when you really want to wait for gvim to finish, you must prevent it from disconnecting.
es_es: Pero cuando se necesita esperar a que gvim termine, hay que evitar dicha desconexión.

source: The "-f" argument does this: >
es_es: El argumento «-f» hace precisamente eso: >

source: The "-f" stands for foreground.
es_es: «-f» significa foreground (primer plano).

source: Now Vim will block the shell it was started in until you finish editing and exit.
es_es: Ahora, Vim bloqueará la consola en la que se inició hasta que termine la edición y cierre el editor.
